#!/usr/bin/python
# -*- coding: utf-8 -*-

import json # import the module of json
import sys # this module is used to get the params from cmd

from chatterbot import ChatBot
from chatterbot.trainers import ListTrainer
from chatterbot import ChatBot
from chatterbot.trainers import ChatterBotCorpusTrainer 
 
my_bot = ChatBot("Training demo")

#my_bot.set_trainer(ChatterBotCorpusTrainer)
#my_bot.train("chatterbot.corpus.chinese")

'''
my_bot.set_trainer(ListTrainer)
my_bot.train([
    "嗳,渡边君,真喜欢我?.",
    "那还用说?.",
    
    "那么,可依得我两件事?.",
    "三件也依得.",
    
    "你好.",
    "你也好.",

    "美女性,女孩,二十岁.",
    "年轻真好,你真美.",

    "妇女性,三十岁.",
    "你看着像二十多岁的.",

    "介绍,女人,认识.",
    "真是荣幸,今天又认识个美女.",
    
    "我不好.",
    "怎么啦"
])
'''


#"  ",
#"$d:通用.$s:已注册;男性;年龄;表情;.$q:给我们合张影吧.",
#"$d:通用.$s:未注册;女性;年龄;表情;.$q:给我们合张影吧.",
#"$d:通用.$s:已注册;女性;年龄;表情;.$q:给我们合张影吧.",

#"$d:通用.$s:未注册;男性;年龄31;.$q:猜年龄.",
#"$d:通用.$s:未注册;男性;年龄20;.$q:合影;拍照;给我们合张影吧.",
#"$d:通用.$s:已注册;女性;年龄;.$q:合影;拍照;给我们合张影吧.",
#"$d:通用.$s:已注册;女性;年龄;.$q:合影;拍照;给我们合张影吧.",

my_list = [

    "$d:通用.$s:未注册;未知性别;年龄;.$q:.",
    "$d:通用.$c:无效.$a:在.",
   
    "$d:通用.$s:未注册;男性;年龄;.$q:.",
    "$d:通用.$c:无效.$a:在.",
    
    "$d:通用.$s:已注册;男性;年龄;.$q:.",
    "$d:通用.$c:无效.$a:在.",

    "$d:通用.$s:未注册;女性;年龄;.$q:.",
    "$d:通用.$c:无效.$a:在.",

    "$d:通用.$s:已注册;女性;年龄;.$q:.",
    "$d:通用.$c:无效.$a:在.",



###识别
    "$d:通用.$s:未注册;男性;年龄;.$q:识别.",
    "$d:识别.$a:准备识别.",

    "$d:通用.$s:已注册;男性;年龄;.$q:识别.",
    "$d:识别.$a:准备识别.",

    "$d:通用.$s:未注册;女性;年龄;.$q:识别.",
    "$d:识别.$a:准备识别.",

    "$d:通用.$s:已注册;女性;年龄;.$q:识别.",
    "$d:识别.$a:准备识别.",



###交互
    "$d:通用.$s:未注册;男性;年龄;.$q:笑一个.",
    "$d:交互.$c:交互=微笑.$a:我笑了.",

    "$d:通用.$s:已注册;男性;年龄;.$q:笑一个.",
    "$d:交互.$c:交互=微笑.$a:我笑了.",

    "$d:通用.$s:未注册;女性;年龄;.$q:笑一个.",
    "$d:交互.$c:交互=微笑.$a:我笑了.",

    "$d:通用.$s:已注册;女性;年龄;.$q:笑一个.",
    "$d:交互.$c:交互=微笑.$a:我笑了.",



    "$d:通用.$s:未注册;男性;年龄;.$q:睡觉吧.",
    "$d:交互.$c:交互=睡觉.$a:我睡了.",

    "$d:通用.$s:已注册;男性;年龄;.$q:睡觉吧.",
    "$d:交互.$c:交互=睡觉.$a:我睡了.",

    "$d:通用.$s:未注册;女性;年龄;.$q:睡觉吧.",
    "$d:交互.$c:交互=睡觉.$a:我睡了.",

    "$d:通用.$s:已注册;女性;年龄;.$q:睡觉吧.",
    "$d:交互.$c:交互=睡觉.$a:我睡了.",



    "$d:通用.$s:未注册;男性;年龄;.$q:摇摇头.",
    "$d:交互.$c:交互=摇头.$a:摇头.",

    "$d:通用.$s:已注册;男性;年龄;.$q:摇摇头.",
    "$d:交互.$c:交互=摇头.$a:摇头.",

    "$d:通用.$s:未注册;女性;年龄;.$q:摇摇头.",
    "$d:交互.$c:交互=摇头.$a:摇头.",

    "$d:通用.$s:已注册;女性;年龄;.$q:摇摇头.",
    "$d:交互.$c:交互=摇头.$a:摇头.",


	
    "$d:通用.$s:未注册;男性;年龄;.$q:点头.",
    "$d:交互.$c:交互=点头.$a:点头.",

    "$d:通用.$s:已注册;男性;年龄;.$q:点头.",
    "$d:交互.$c:交互=点头.$a:点头.",

    "$d:通用.$s:未注册;女性;年龄;.$q:点头.",
    "$d:交互.$c:交互=点头.$a:点头.",

    "$d:通用.$s:已注册;女性;年龄;.$q:点头.",
    "$d:交互.$c:交互=点头.$a:点头.",
	
	
	
	"$d:通用.$s:未注册;男性;年龄;.$q:向左转.",
    "$d:交互.$c:交互=左转.$a:左转.",

    "$d:通用.$s:已注册;男性;年龄;.$q:向左转.",
    "$d:交互.$c:交互=左转.$a:左转.",

    "$d:通用.$s:未注册;女性;年龄;.$q:向左转.",
    "$d:交互.$c:交互=左转.$a:左转.",

    "$d:通用.$s:已注册;女性;年龄;.$q:向左转.",
    "$d:交互.$c:交互=左转.$a:左转.",
	
	
	
	"$d:通用.$s:未注册;男性;年龄;.$q:向右转.",
    "$d:交互.$c:交互=右转.$a:右转.",

    "$d:通用.$s:已注册;男性;年龄;.$q:向右转.",
    "$d:交互.$c:交互=右转.$a:右转.",

    "$d:通用.$s:未注册;女性;年龄;.$q:向右转.",
    "$d:交互.$c:交互=右转.$a:右转.",

    "$d:通用.$s:已注册;女性;年龄;.$q:向右转.",
    "$d:交互.$c:交互=右转.$a:右转.",
###



       
    "$d:通用.$s:未注册;男性;年龄;.$q:设置用户信息.",
    "$d:用户.$a:准备设置用户信息.",

    "$d:通用.$s:已注册;男性;年龄;.$q:设置用户信息.",
    "$d:用户.$a:准备设置用户信息.",
    
    "$d:通用.$s:未注册;女性;年龄;.$q:设置用户信息.",
    "$d:用户.$a:准备设置用户信息.",

    "$d:通用.$s:已注册;女性;年龄;.$q:设置用户信息.",
    "$d:用户.$a:准备设置用户信息.",

    "$d:通用.$s:未注册;未知性别;年龄;.$q:设置用户信息.",
    "$d:用户.$a:准备设置用户信息.",
###
    


    "$d:通用.$s:未注册;未知性别;年龄;.$q:声音触发.",
    "$d:通用.$a:我在.",

    "$d:通用.$s:未注册;男性;年龄;.$q:声音触发.",
    "$d:通用.$a:帅哥你好.",

    "$d:通用.$s:未注册;女性;年龄;.$q:声音触发.",
    "$d:通用.$a:美女你好.",
    
    "$d:通用.$s:已注册;男性;年龄;.$q:声音触发.",
    "$d:通用.$a:小主人您好.",    

    "$d:通用.$s:已注册;女性;年龄;.$q:声音触发.",
    "$d:通用.$a:小主人您好.",

    "$d:通用.$s:未注册;男性;年龄;.$q:视觉触发.",
    "$d:通用.$a:帅哥你好.",

    "$d:通用.$s:已注册;男性;年龄;.$q:视觉触发.",
    "$d:通用.$a:小主人你好.",
    
    "$d:通用.$s:未注册;女性;年龄;.$q:视觉触发.",
    "$d:通用.$a:美女你好.",
    
    "$d:通用.$s:已注册;女性;年龄;.$q:视觉触发.",
    "$d:通用.$a:小主人你好.",


###    
    "$d:通用.$s:未注册;男性;年龄;.$q:我是男性.",
    "$d:用户.$c:设置性别=男.$a:已经设置好您的性别.",

    "$d:通用.$s:未注册;男性;年龄;.$q:我是男性.",
    "$d:用户.$c:设置性别=男.$a:已经设置好您的性别.",

    "$d:通用.$s:未注册;男性;年龄;.$q:我是女性.",
    "$d:用户.$c:设置性别=女.$a:已经设置好您的性别.",
    
    ###"$d:用户.$s:未注册;男性;年龄;.$q:我年龄.",
    ###"$d:用户.$c:设置年龄.$a:已经设置好您的年龄.",
    
    "$d:通用.$s:未注册;男性;年龄;.$q:我叫.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",

    "$d:通用.$s:已注册;男性;年龄;.$q:我叫.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",
    
    "$d:通用.$s:未注册;女性;年龄;.$q:我叫.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",

    "$d:通用.$s:已注册;女性;年龄;.$q:我叫.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",

    "$d:通用.$s:未注册;男性;年龄;.",
    "$d:用户.$a:小主人您好,我叫小艾,怎么称呼您.",

    "$d:通用.$s:未注册;未知性别;年龄;.$q:叫我.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",


###
    "$d:通用.$s:未注册;男性;年龄;.$q:介绍一位新朋友给你认识.",
    "$d:介绍.$a:迫不及待了，快让新朋友和我打个招呼.",

    "$d:通用.$s:已注册;男性;年龄;.$q:介绍一位新朋友给你认识.",
    "$d:介绍.$a:迫不及待了，快让新朋友和我打个招呼.",

    "$d:通用.$s:未注册;女性;年龄;.$q:介绍一位新朋友给你认识.",
    "$d:介绍.$a:迫不及待了，快让新朋友和我打个招呼.",

    "$d:通用.$s:已注册;女性;年龄;.$q:介绍一位新朋友给你认识.",
    "$d:介绍.$a:迫不及待了，快让新朋友和我打个招呼.",


###    
    "$d:介绍.$s:未注册;男性;年龄;.$q:小乐你好.",
    "$d:介绍.$a:我最最尊敬的主人,很高兴你今天又带了一位帅哥回家,眼光不错哦,请问新朋友叫什么名字.",

    "$d:介绍.$s:已注册;男性;年龄;.$q:小乐你好.",
    "$d:介绍.$a:我最最尊敬的主人,很高兴你今天又带了一位帅哥回家,眼光不错哦,请问新朋友叫什么名字.",
    
    "$d:介绍.$s:未注册;女性;年龄;.$q:小乐你好.",
    "$d:介绍.$a:我最最尊敬的主人,很高兴你今天又带了一位女士回家,眼光不错哦,请问新朋友叫什么名字.",

    "$d:介绍.$s:已注册;女性;年龄;.$q:小乐你好.",
    "$d:介绍.$a:我最最尊敬的主人,很高兴你今天又带了一位女士回家,眼光不错哦,请问新朋友叫什么名字.",


###    
    "$d:介绍.$s:未注册;男性;年龄;.$q:我叫.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",

    "$d:介绍.$s:已注册;男性;年龄;.$q:我叫.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",
    
    "$d:介绍.$s:未注册;女性;年龄;.$q:我叫.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",

    "$d:介绍.$s:已注册;女性;年龄;.$q:我叫.",
    "$d:用户.$c:设置姓名.$a:你好,很高兴认识.",
###



    "$d:通用.$s:已注册;男性;平静;.",
    "$d:通用.$a:你好,小刚,有什么可以为你效劳.",

    "$d:通用.$s:已注册;男性;高兴;.",
    "$d:通用.$a:你好,小刚,你今天很开心呀.",

    "$d:通用.$s:已注册;男性;愤怒;.",
    "$d:通用.$a:你好,小刚,消消气.",
    
    "$d:通用.$s:已注册;若依;女性;.",
    "$d:通用.$a:你好,若依,有什么可以为你效劳.",

    "$d:通用.$s:已注册;小霞;女性;平静;.",
    "$d:通用.$a:你好,小霞,有什么可以为你效劳.",



###
    "$d:通用.$s:未注册;若依;女性;",
    "$d:用户.$a:你好,若依,很高兴认识你.",    

    "$d:通用.$s:未注册;若一;女性;",
    "$d:用户.$a:你好,若依,很高兴认识你.",

    "$d:通用.$s:已注册;若一;女性;",
    "$d:用户.$a:你好,若依,很高兴认识你.",




###    
    "$d:通用.$s:男性;高兴.",
    "$d:通用.$a:帅哥,今天看着挺开心呀.",

    "$d:通用.$s:男性,",
    "$d:通用.$a:今天心情如何呀.",
    
    "$d:通用.$s:男性,愤怒.",
    "$d:通用.$a:小哥哥,消消气.",

    "$d:通用.$s:女性,",
    "$d:通用.$a:美女今天心情如何呀.",

    "$d:通用.$s:已注册;若依;女性;.",
    "$d:通用.$a:你好,若依,有什么可以为您效劳.", 

    "$d:通用.$s:已注册;李佳;男性;.",
    "$d:通用.$a:你好,李佳,有什么可以为您效劳.",




    ###"$d:用户.$s:未注册;男性;年龄;平静;.$q:我年龄.", 
    ###"$d:用户.$c:设置年龄.$a:设置年龄完成.",

    ###"$d:用户.$s:未注册;女性;年龄;平静;.$q:我年龄.", 
    ###"$d:用户.$c:设置年龄.$a:设置年龄完成.",

###
    "$d:用户.$s:未注册;男性;年龄;.$q:我是哥哥.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",

    "$d:用户.$s:已注册;男性;年龄;.$q:我是哥哥.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",
    
    "$d:用户.$s:未注册;男性;年龄;.$q:我是弟弟.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",

    "$d:用户.$s:已注册;男性;年龄;.$q:我是弟弟.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",
    
    "$d:用户.$s:未注册;男性;年龄;.$q:我是叔叔.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",

    "$d:用户.$s:已注册;男性;年龄;.$q:我是叔叔.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",
    
    "$d:用户.$s:未注册;男性;年龄;.$q:我是帅哥.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",

    "$d:用户.$s:已注册;男性;年龄;.$q:我是帅哥.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",
    
    "$d:用户.$s:未注册;男性;年龄;.$q:我是男性.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",

    "$d:用户.$s:已注册;男性;年龄;.$q:我是男性.", 
    "$d:用户.$c:设置性别=男性.$a:设置性别完成.",
    
    "$d:用户.$s:未注册;女性;年龄;.$q:我是美女.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",

    "$d:用户.$s:已注册;女性;年龄;.$q:我是美女.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",

    "$d:用户.$s:未注册;女性;年龄;.$q:我是美女.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",

    "$d:用户.$s:已注册;女性;年龄;.$q:我是美女.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",
    
    "$d:用户.$s:未注册;女性;年龄;.$q:我是女性.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",

    "$d:用户.$s:已注册;女性;年龄;.$q:我是女性.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",
    
    "$d:用户.$s:未注册;女性;年龄;.$q:我是姐姐.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",

    "$d:用户.$s:已注册;女性;年龄;.$q:我是姐姐.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",
    
    "$d:用户.$s:未注册;女性;年龄;.$q:我是妹妹.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",

    "$d:用户.$s:已注册;女性;年龄;.$q:我是妹妹.", 
    "$d:用户.$c:设置性别=女性.$a:设置性别完成.",



    "$d:电影.高兴.",
    "$d:电影.推荐哥最新大片给你吧.",

    "$d:电影.愤怒.",
    "$d:电影.看个喜剧,一笑了之吧.",
    
    "$d:用户.男性,程序员.",
    "$d:用户.真的么,帅气的不像一个程序员呀.",

    "$d:用户.$s:男性;经理.",
    "$d:用户.$a:年轻有为呀.",



###
    "$d:通用.$s:未注册;未知性别;年龄;.$q:猜年龄.",
    "$d:猜年龄.$a:看不到您哦,请站在镜头前.",

    "$d:通用.$s:已注册;未知性别;年龄;.$q:猜年龄.",
    "$d:猜年龄.$a:看不到您哦,请站在镜头前.",

    "$d:猜年龄.$s:未注册;未知性别;年龄;.$q:你猜我几岁.",
    "$d:猜年龄.$a:看不到您哦,请站在镜头前.",

    "$d:猜年龄.$s:已注册;未知性别;年龄;.$q:你猜我几岁.",
    "$d:猜年龄.$a:看不到您哦,请站在镜头前.",

    "$d:猜年龄.$s:未注册;未知性别;年龄;.$q:你猜我多大.",
    "$d:猜年龄.$a:看不到您哦,请站在镜头前.",

    "$d:猜年龄.$s:已注册;未知性别;年龄;.$q:你猜我多大.",
    "$d:猜年龄.$a:看不到您哦,请站在镜头前.",



###
    "$d:通用.$s:未注册;男性20;年龄;.$q:猜年龄.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是年轻有为.",

    "$d:通用.$s:已注册;男性20;年龄;.$q:猜年龄.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是年轻有为.",

    "$d:猜年龄.$s:未注册;男性;年龄20;.$q:你猜我几岁.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是年轻有为.",

    "$d:猜年龄.$s:已注册;男性;年龄20;.$q:你猜我几岁.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是年轻有为.",
    
    "$d:猜年龄.$s:未注册;男性;年龄20;.$q:你猜我多大.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是年轻有为.",
    
    "$d:猜年龄.$s:已注册;男性;年龄20;.$q:你猜我多大.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是年轻有为.",



###
    "$d:通用.$s:未注册;男性;年龄30;.$q:猜年龄.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是魅力成熟.",

    "$d:通用.$s:已注册;男性;年龄30;.$q:猜年龄.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是魅力成熟.",

    "$d:猜年龄.$s:未注册;男性;年龄30;.$q:你猜我几岁.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是魅力成熟.",

    "$d:猜年龄.$s:已注册;男性;年龄30;.$q:你猜我几岁.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是魅力成熟.",
    
    "$d:猜年龄.$s:未注册;男性;年龄30;.$q:你猜我多大.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是魅力成熟.",
    
    "$d:猜年龄.$s:已注册;男性;年龄30;.$q:你猜我多大.",
    "$d:猜年龄.$c:猜年龄.$a:帅哥,我猜你的年龄是@:年龄#岁,真是魅力成熟.",



###
    "$d:通用.$s:未注册;女性;年龄20;.$q:猜年龄.",
    "$d:猜年龄.$c:猜年龄.$a:美女,我猜你的年龄是@:年龄#岁,真是年轻又漂亮.",
   
    "$d:通用.$s:已注册;女性;年龄20;.$q:猜年龄.",
    "$d:猜年龄.$c:猜年龄.$a:美女,我猜你的年龄是@:年龄#岁,真是年轻又漂亮.",

    "$d:猜年龄.$s:未注册;女性;年龄20;.$q:你猜我几岁.",
    "$d:猜年龄.$c:猜年龄.$a:美女,我猜你的年龄是@:年龄#岁,真是年轻又漂亮.",

    "$d:猜年龄.$s:已注册;女性;年龄20;.$q:你猜我几岁.",
    "$d:猜年龄.$c:猜年龄.$a:美女,我猜你的年龄是@:年龄#岁,真是年轻又漂亮.",
    
    "$d:猜年龄.$s:未注册;女性;年龄20;.$q:你猜我多大.",
    "$d:猜年龄.$c:猜年龄.$a:美女,我猜你的年龄是@:年龄#岁,真是年轻又漂亮.",
    
    "$d:猜年龄.$s:已注册;女性;年龄20;.$q:你猜我多大.",
    "$d:猜年龄.$c:猜年龄.$a:美女,我猜你的年龄是@:年龄#岁,真是年轻又漂亮.",


                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        
###
    "$d:通用.$s:未注册;女性;年龄30;.$q:猜年龄.",
    "$d:猜年龄.$c:猜年龄.$a:美女,你看上去比你的年龄小哦.",

    "$d:通用.$s:已注册;女性;年龄30;.$q:猜年龄.",
    "$d:猜年龄.$c:猜年龄.$a:美女,你看上去比你的年龄小哦.",

    "$d:猜年龄.$s:未注册;女性;年龄30;.$q:你猜我几岁.",
    "$d:猜年龄.$c:猜年龄.$a:美女,你看上去比你的年龄小哦.",

    "$d:猜年龄.$s:已注册;女性;年龄30;.$q:你猜我几岁.",
    "$d:猜年龄.$c:猜年龄.$a:美女,你看上去比你的年龄小哦.",
    
    "$d:猜年龄.$s:未注册;女性;年龄30;.$q:你猜我多大.",
    "$d:猜年龄.$c:猜年龄.$a:美女,你看上去比你的年龄小哦.",
    
    "$d:猜年龄.$s:已注册;女性;年龄30;.$q:你猜我多大.",
    "$d:猜年龄.$c:猜年龄.$a:美女,你看上去比你的年龄小哦.",




###全景拍照   
    "$d:通用.$s:未注册;男性;年龄;.$q:合影.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:已注册;男性;年龄;.$q:合影.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:未注册;男性;年龄;.$q:拍照.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:已注册;男性;年龄;.$q:拍照.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:未注册;男性;年龄;.$q:给我们合张影吧.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:已注册;男性;年龄;.$q:给我们合张影吧.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",
    
#女性
    "$d:通用.$s:未注册;女性;年龄;.$q:合影.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:已注册;女性;年龄;.$q:合影.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:未注册;女性;年龄;.$q:拍照.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:已注册;女性;年龄;.$q:拍照.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",
    
    "$d:通用.$s:未注册;女性;年龄;.$q:给我们合张影吧.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    "$d:通用.$s:已注册;女性;年龄;.$q:给我们合张影吧.",
    "$d:全景拍照.$a:好的,请大家摆好姿势,我给大家来张全景照片.",

    
##男
    "$d:全景拍照.$s:未注册;男性;年龄;.$q:准备好了,开始.",
    "$d:全景拍照.$c:全景拍照.$a:准备好的话,我要开始了,1,2,3,茄子.",

    "$d:全景拍照.$s:已注册;男性;年龄;.$q:准备好了,开始.",
    "$d:全景拍照.$c:全景拍照.$a:准备好的话,我要开始了,1,2,3,茄子.",
##女
    "$d:全景拍照.$s:未注册;女性;年龄;.$q:准备好了,开始.",
    "$d:全景拍照.$c:全景拍照.$a:准备好的话,我要开始了,1,2,3,茄子.",

    "$d:全景拍照.$s:已注册;女性;年龄;.$q:准备好了,开始.",
    "$d:全景拍照.$c:全景拍照.$a:准备好的话,我要开始了,1,2,3,茄子.",





    
  
    ]
my_bot.set_trainer(ListTrainer)
my_bot.train(my_list)

# test
#print(my_bot.get_response("真喜欢我?"))
#print(my_bot.get_response("可依得我两件事?"))

#ret = my_bot.get_response("我不好")




# 开始对话
while True:
    print(my_bot.get_response(input(">")))
    



#for i in range(len(sys.argv)):
#    print('arg'+str(i),sys.argv[i])

params = sys.argv[1]
#obj = json.loads(params) #str to obj
#print(params)
ret = my_bot.get_response(params)

#jsonob = {'ret':'lijia'}
#jsonob = {'ret':str(ret)}
#print(jsonob)
#strjson = json.dumps(jsonob,sort_keys=True)
#print(strjson)
#print("aaaaaaaaaaa")
#

#for i in range(len(sys.argv)):
#    print('arg'+str(i),sys.argv[i])



