#!/usr/bin/python
# -*- coding: utf-8 -*-

import json # import the module of json
import sys # this module is used to get the params from cmd

from chatterbot import ChatBot
from chatterbot.trainers import ListTrainer
from chatterbot import ChatBot
from chatterbot.trainers import ChatterBotCorpusTrainer 
 
my_bot = ChatBot("Training demo")

#my_bot.set_trainer(ChatterBotCorpusTrainer)
#my_bot.train("chatterbot.corpus.chinese")

'''
my_bot.set_trainer(ListTrainer)
my_bot.train([
    "嗳,渡边君,真喜欢我?",
    "那还用说?",
    
    "那么,可依得我两件事?",
    "三件也依得",
    
    "你好",
    "你也好",

    "美女性,女孩,二十岁",
    "年轻真好,你真美",

    "妇女性,三十岁",
    "你看着像二十多岁的",

    "介绍,女人,认识",
    "真是荣幸,今天又认识个美女",
    
    "我不好",
    "怎么啦"
])
'''

my_list = [
    "通用:设置用户信息",
    "用户:准备设置用户信息",

    "通用:未注册,样式1,触发",
    "通用:我在",

    "通用:未注册,样式2,触发",
    "通用:在",

    "通用:未注册,样式3,触发",
    "通用:您好",

    "通用:未注册,女性,触发",
    "通用:美女您好",

    "通用:未注册,男性,触发",
    "通用:帅哥您好",
    
    "通用:已注册,样式1,触发",
    "通用:小主人您好",    

    "通用:已注册,样式2,触发",
    "通用:小主人您有什么吩咐",
    
    "用户:我是",
    "用户:设置性别:已经设置好您的性别",

    "用户:年龄",
    "用户:设置年龄:已经设置好您的年龄",

    "通用:未注册,我叫,叫我",
    "用户:设置姓名:主人你好,很高兴认识",

    "通用:未注册,女性,我叫,叫我",
    "用户:设置姓名:美女你好,很高兴认识",
    
    "通用:未注册,男性性,我叫",
    "用户:设置姓名:帅哥你好,很高兴认识",

    "通用:我是哥哥",
    "用户:设置性别:已经设置好您的性别",

    "用户:未注册,年龄",
    "用户:设置年龄:已经设置好您的年龄",

    "通用:未注册,我叫",
    "用户:设置姓名:主人你好,很高兴认识",

    "通用:未注册,女性,我叫",
    "用户:设置姓名:美女你好,很高兴认识",
    
    "通用:未注册,男性性,我叫",
    "用户:设置姓名:帅哥你好,很高兴认识",
    
    "通用:未注册0",
    "用户:小主人您好,我叫小艾,怎么称呼您",




    "通用:介绍一位新朋友给你认识",
    "介绍:迫不及待了，快让新朋友和我打个招呼",
    
    "介绍:未注册,女性",
    "介绍:我最最尊敬的主人,很高兴你今天又带了一位女士回家,眼光不错哦",

    "介绍:未注册,男性",
    "介绍:我最最尊敬的主人,很高兴你今天又带了一位帅哥回家,眼光不错哦",



    
    "通用:已注册,女性,若依",
    "通用:你好,若依,有什么可以为你效劳",

    "通用:未注册,若依",
    "用户:你好,若依,很高兴认识你",    
    
    "通用:男性,高兴",
    "通用:帅哥,今天看着挺开心呀",

    "通用:男性,平静",
    "通用:今天心情如何呀",
    
    "通用:男性,愤怒",
    "通用:小哥哥,消消气",

    "通用:女性,平静",
    "通用:美女今天心情如何呀",

    "通用:已注册,男性,石头",
    "通用:你好,石头,有什么可以为您效劳",

    "通用:已注册,女性,翠花",
    "通用:你好,翠花,有什么可以为您效劳",    



    
    "电影:高兴",
    "电影:推荐哥最新大片给你吧",

    "电影:愤怒",
    "电影:看个喜剧,一笑了之吧",
    
    "用户:男性,程序员",
    "用户:真的么,帅气的不像一个程序员呀",

    "用户:男性,经理",
    "用户:年轻有为呀",



    "唤醒:你好,联想",
    "唤醒:在",

    "唤醒:你好,联想",
    "唤醒:我在",    

    "唤醒:你好,联想",
    "唤醒:在呢",



    "通用:猜年龄",
    "猜年龄:好的,谁先来？",

    "通用:未注册,猜年龄",
    "猜年龄:谁先来，请站在我对面？",

    "通用:未注册,你猜我多大",
    "猜年龄:请站在我对面？",

    "通用:未注册,你猜我几岁",
    "猜年龄:请站在我对面？",
    
    "通用:女性,20岁,你猜我多大？",
    "猜年龄:美女性,我猜你的年龄是$年龄岁, 真是年轻又漂亮",

    "通用:女性,30岁,你猜我多大？",
    "猜年龄:你看上去比你的年龄小哦",

    "通用:男性,20岁,你猜我多大？",
    "猜年龄:帅哥,我猜你的年龄是$年龄岁, 真是年轻有为",

    "通用:男性,30岁,你猜我多大？",
    "猜年龄:帅哥,我猜你的年龄是$年龄岁, 真是魅力成熟",

    "通用:女性,20岁,你猜我几岁？",
    "猜年龄:美女性,我猜你的年龄是$年龄岁, 真是年轻又漂亮",

    "通用:女性,30岁,你猜我几岁？",
    "猜年龄:你看上去比你的年龄小哦",

    "通用:男性,20岁,你猜我几岁？",
    "猜年龄:帅哥,我猜你的年龄是$年龄岁, 真是年轻有为",

    "通用:男性,30岁,你猜我几岁？",
    "猜年龄:帅哥,我猜你的年龄是$年龄岁, 真是魅力成熟",   




    "通用:合影;拍照;给我们合张影吧",
    "全景拍照:好的,请大家摆好姿势,我给大家来张全景照片",
    

    "全景拍照:全景拍照,准备好了;开始吧",
    "全景拍照:准备好的话,我要开始了,1,2,3,茄子",

  
    ]
my_bot.set_trainer(ListTrainer)
my_bot.train(my_list)

# test
#print(my_bot.get_response("真喜欢我?"))
#print(my_bot.get_response("可依得我两件事?"))

#ret = my_bot.get_response("我不好")




# 开始对话
while True:
    print(my_bot.get_response(input(">")))
    



#for i in range(len(sys.argv)):
#    print('arg'+str(i),sys.argv[i])

params = sys.argv[1]
#obj = json.loads(params) #str to obj
#print(params)
ret = my_bot.get_response(params)

#jsonob = {'ret':'lijia'}
#jsonob = {'ret':str(ret)}
#print(jsonob)
#strjson = json.dumps(jsonob,sort_keys=True)
#print(strjson)
#print("aaaaaaaaaaa")
#

#for i in range(len(sys.argv)):
#    print('arg'+str(i),sys.argv[i])



